---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.IsPespective
source: html/e5b44850-c499-942a-b1b1-1cbf145e1417.htm
---
# Autodesk.Revit.DB.CameraInfo.IsPespective Property

Identifies whether the projection is orthographic or perspective

## Syntax (C#)
```csharp
public bool IsPespective { get; }
```